misc/request.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
    <soap:Body>
        <ns1:GetStopMonitoring xmlns:ns1="http://wsdl.siri.org.uk">
            <ServiceRequestInfo
                    xmlns:ns5="http://www.siri.org.uk/siri">
                <ns5:ServiceRequestContext/>
                <ns5:RequestTimestamp>2020-10-14T10:12:40.698+02:00</ns5:RequestTimestamp>
                <ns5:Address>https://api.agglo-larochelle.fr/capsiria/services/siri</ns5:Address>
                <ns5:RequestorRef>siriclientyelo</ns5:RequestorRef>
                <ns5:MessageIdentifier>826dbc17-1cd0-4b7f-9293-13501174c8ed</ns5:MessageIdentifier>
            </ServiceRequestInfo>
            <Request
                    xmlns:ns5="http://www.siri.org.uk/siri" version="1.3">
                <ns5:RequestTimestamp>2020-10-14T10:12:40.686+02:00</ns5:RequestTimestamp>
                <ns5:MessageIdentifier>4cc4393e-d856-4489-9268-d81f0eb5cc29</ns5:MessageIdentifier>
                    <ns5:MonitoringRef>1033</ns5:MonitoringRef>
<!--                    <ns5:MinimumStopVisitsPerLine>20</ns5:MinimumStopVisitsPerLine>-->
<!--                    <ns5:StopMonitoringDetailLevel>full</ns5:StopMonitoringDetailLevel>-->
            </Request>
            <RequestExtension
                    xmlns:ns5="http://www.siri.org.uk/siri"/>
        </ns1:GetStopMonitoring>
    </soap:Body>
</soap:Envelope>

        <!--<?xml version="1.0" encoding="UTF-8"?>-->
        <!--<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">-->
        <!--    <soapenv:Header/>-->
        <!--    <soapenv:Body>-->
        <!--        <GetVehicleMonitoring xmlns="http://www.siri.org.uk/siri">-->
        <!--            <ServiceRequestInfo xmlns="">-->
        <!--                <RequestTimestamp xmlns="http://www.siri.org.uk/siri">2021-02-24T10:49:06.974541+01:00</RequestTimestamp>-->
        <!--                <RequestorRef xmlns="http://www.siri.org.uk/siri">rtcrsiri</RequestorRef>-->
        <!--                <siri:MessageIdentifier xmlns:siri="http://www.siri.org.uk/siri">VehiculeMonitoringRQ:Check:1</siri:MessageIdentifier>-->
        <!--            </ServiceRequestInfo>-->
        <!--            <Request xmlns="" version="2.0">-->
        <!--                <siri:RequestTimestamp xmlns:siri="http://www.siri.org.uk/siri">2021-02-24T10:49:06.974624+01:00</siri:RequestTimestamp>-->
        <!--                <siri:MessageIdentifier xmlns:siri="http://www.siri.org.uk/siri">99097250-bc17-4730-9306-d06a62fa7cca</siri:MessageIdentifier>-->
        <!--                <siri:LineRef xmlns:siri="http://www.siri.org.uk/siri">12</siri:LineRef>-->
        <!--            </Request>-->
        <!--            <RequestExtension xmlns=""/>-->
        <!--        </GetVehicleMonitoring>-->
        <!--    </soapenv:Body>-->
        <!--</soapenv:Envelope>-->
