core/testdata/siri-service-request-soap.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:m0="http://www.siri.org.uk/siri" xmlns:m1="http://www.ifopt.org.uk/acsb">
  <SOAP-ENV:Body>
    <m:GetSiriService xmlns:m="http://wsdl.siri.org.uk">
      <Request>
        <m0:ServiceRequestContext>
        </m0:ServiceRequestContext>
        <m0:RequestTimestamp>2001-12-17T09:30:47Z</m0:RequestTimestamp>
        <m0:RequestorRef>RATPDEV:Concerto</m0:RequestorRef>
        <m0:MessageIdentifier>GetSIRIStopMonitoring:Test:0</m0:MessageIdentifier>
        <m0:DelegatorRef/>
        <m0:StopMonitoringRequest version="2.0:FR-IDF-2.4">
          <m0:RequestTimestamp>2017-01-10T16:30:47Z</m0:RequestTimestamp>
          <m0:MessageIdentifier>GetSIRIStopMonitoring:Test:0</m0:MessageIdentifier>
          <m0:MonitoringRef>boaarle</m0:MonitoringRef>
          <m0:StopVisitTypes>all</m0:StopVisitTypes>
        </m0:StopMonitoringRequest>
        <m0:StopMonitoringRequest version="2.0:FR-IDF-2.4">
          <m0:RequestTimestamp>2017-01-10T16:30:47Z</m0:RequestTimestamp>
          <m0:MessageIdentifier>GetSIRIStopMonitoring:Test:0</m0:MessageIdentifier>
          <m0:MonitoringRef>cladebr</m0:MonitoringRef>
          <m0:StopVisitTypes>all</m0:StopVisitTypes>
        </m0:StopMonitoringRequest>
      </Request>
    </m:GetSiriService>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>