src/test/resources/discoveryTest/lines_soap_to_xml_test.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:wsdl="http://wsdl.siri.org.uk" xmlns:siri="http://www.siri.org.uk/siri">
    <soapenv:Header/>
    <soapenv:Body>
        <wsdl:LinesDiscovery>
            <Request version="2.0">
                <siri:RequestTimestamp>2022-04-06T12:29:51.185746+02:00</siri:RequestTimestamp>
                <siri:RequestorRef>siriclientyelo</siri:RequestorRef>
            </Request>
            <RequestExtension>
            </RequestExtension>
        </wsdl:LinesDiscovery>
    </soapenv:Body>
</soapenv:Envelope>
