siri/tests/testdata/checkstatus-soap-request.xml

<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/"
            xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
  <S:Body>
    <ns7:CheckStatus xmlns:ns2="http://www.siri.org.uk/siri" xmlns:ns7="http://wsdl.siri.org.uk">
      <Request>
        <ns2:RequestTimestamp>2016-09-22T07:39:21.359Z</ns2:RequestTimestamp>
        <ns2:RequestorRef>NINOXE:default</ns2:RequestorRef>
        <ns2:MessageIdentifier>Ara:Message::d3f94aa2-7b76-449b-aa18-50caf78f9dc7:LOC</ns2:MessageIdentifier>
      </Request>
      <RequestExtension />
    </ns7:CheckStatus>
  </S:Body>
</S:Envelope>
