siri/tests/testdata/stopdiscovery-request.xml

<?xml version="1.0" encoding="UTF-8"?>
<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/">
   <S:Body>
      <ns7:StopPointsDiscovery xmlns:ns7="http://wsdl.siri.org.uk" xmlns:ns2="http://www.siri.org.uk/siri">
         <Request>
            <ns2:RequestTimestamp>2017-03-03T11:28:00.359Z</ns2:RequestTimestamp>
            <ns2:RequestorRef>STIF</ns2:RequestorRef>
         </Request>
         <RequestExtension />
      </ns7:StopPointsDiscovery>
   </S:Body>
</S:Envelope>
