siri/tests/testdata/terminated_subscription_request-soap.xml

<?xml version='1.0' encoding='utf-8'?>
  <S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/">
  <S:Body>
    <ns1:DeleteSubscription xmlns:ns1="http://wsdl.siri.org.uk">
      <ServiceRequestInfo xmlns:ns5="http://www.siri.org.uk/siri">
        <ns5:RequestTimestamp>2009-11-10T23:00:00.000Z</ns5:RequestTimestamp>
        <ns5:RequestorRef>NINOXE:default</ns5:RequestorRef>
        <ns5:MessageIdentifier>TermSubReq:Test:0</ns5:MessageIdentifier>
      </ServiceRequestInfo>
      <Request version="2.0:FR-IDF-2.4">
        <ns1:SubscriptionRef>SubscriberRef</ns1:SubscriptionRef>
      </Request>
      <RequestExtension/>
    </ns1:DeleteSubscription>
  </S:Body>
</S:Envelope>
